esp8266/Arduino/boards.txt
##############################################################
phoenix_v2.name=Phoenix 2.0
phoenix_v2.build.board=ESP8266_PHOENIX_V2
phoenix_v2.build.variant=phoenix_v2
phoenix_v2.upload.tool=esptool
phoenix_v2.upload.speed=115200
phoenix_v2.upload.maximum_data_size=81920
phoenix_v2.upload.wait_for_upload_port=true
phoenix_v2.serial.disableDTR=true
phoenix_v2.serial.disableRTS=true
phoenix_v2.build.mcu=esp8266
phoenix_v2.build.core=esp8266
phoenix_v2.build.spiffs_pagesize=256
phoenix_v2.build.debug_port=
phoenix_v2.build.debug_level=
phoenix_v2.menu.CpuFrequency.80=80 MHz
phoenix_v2.menu.CpuFrequency.80.build.f_cpu=80000000L
phoenix_v2.menu.CpuFrequency.160=160 MHz
phoenix_v2.menu.CpuFrequency.160.build.f_cpu=160000000L
phoenix_v2.build.flash_mode=dio
phoenix_v2.build.flash_freq=40
phoenix_v2.menu.FlashSize.4M1M=4M (1M SPIFFS)
phoenix_v2.menu.FlashSize.4M1M.build.flash_size=4M
phoenix_v2.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_pagesize=256
phoenix_v2.menu.FlashSize.4M1M.upload.maximum_size=1044464
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_start=0x300000
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
phoenix_v2.menu.FlashSize.4M3M=4M (3M SPIFFS)
phoenix_v2.menu.FlashSize.4M3M.build.flash_size=4M
phoenix_v2.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
phoenix_v2.menu.FlashSize.4M3M.build.spiffs_pagesize=256
phoenix_v2.menu.FlashSize.4M3M.upload.maximum_size=1044464
phoenix_v2.menu.FlashSize.4M3M.build.spiffs_start=0x100000
phoenix_v2.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
phoenix_v2.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
phoenix_v2.menu.ResetMethod.ck=ck
phoenix_v2.menu.ResetMethod.ck.upload.resetmethod=ck
phoenix_v2.menu.ResetMethod.nodemcu=nodemcu
phoenix_v2.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
phoenix_v2.menu.LwIPVariant.open=v2
phoenix_v2.menu.LwIPVariant.open.build.lwip_include=lwip2/include
phoenix_v2.menu.LwIPVariant.open.build.lwip_lib=-llwip2
phoenix_v2.menu.LwIPVariant.Prebuilt=Prebuilt Source (gcc)
phoenix_v2.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
phoenix_v2.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
phoenix_v2.menu.LwIPVariant.Espressif=Espressif (xcc)
phoenix_v2.menu.LwIPVariant.Espressif.build.lwip_lib=-llwip
phoenix_v2.menu.LwIPVariant.Espressif.build.lwip_flags=-DLWIP_MAYBE_XCC
phoenix_v2.menu.LwIPVariant.OpenSource=Open Source (gcc)
phoenix_v2.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
phoenix_v2.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
phoenix_v2.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
phoenix_v2.menu.Debug.Disabled=Disabled
phoenix_v2.menu.Debug.Disabled.build.debug_port=
phoenix_v2.menu.Debug.Serial=Serial
phoenix_v2.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
phoenix_v2.menu.Debug.Serial1=Serial1
phoenix_v2.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
phoenix_v2.menu.DebugLevel.None____=None
phoenix_v2.menu.DebugLevel.None____.build.debug_level=
phoenix_v2.menu.DebugLevel.SSL=SSL
phoenix_v2.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
phoenix_v2.menu.DebugLevel.TLS_MEM=TLS_MEM
phoenix_v2.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
phoenix_v2.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
phoenix_v2.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
phoenix_v2.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
phoenix_v2.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
phoenix_v2.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
phoenix_v2.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
phoenix_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
phoenix_v2.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.CORE=CORE
phoenix_v2.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
phoenix_v2.menu.DebugLevel.WIFI=WIFI
phoenix_v2.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
phoenix_v2.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
phoenix_v2.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
phoenix_v2.menu.DebugLevel.UPDATER=UPDATER
phoenix_v2.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
phoenix_v2.menu.DebugLevel.OTA=OTA
phoenix_v2.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
phoenix_v2.menu.DebugLevel.NULL=NULL
phoenix_v2.menu.DebugLevel.NULL.build.debug_level= -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
phoenix_v2.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTANULL=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+NULL
phoenix_v2.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTANULL.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTANULL=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+NULL
phoenix_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTANULL.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
phoenix_v2.menu.UploadSpeed.115200=115200
phoenix_v2.menu.UploadSpeed.115200.upload.speed=115200
phoenix_v2.menu.UploadSpeed.9600=9600
phoenix_v2.menu.UploadSpeed.9600.upload.speed=9600
phoenix_v2.menu.UploadSpeed.57600=57600
phoenix_v2.menu.UploadSpeed.57600.upload.speed=57600
phoenix_v2.menu.UploadSpeed.256000.windows=256000
phoenix_v2.menu.UploadSpeed.256000.windows.upload.speed=256000
phoenix_v2.menu.UploadSpeed.230400.linux=230400
phoenix_v2.menu.UploadSpeed.230400.linux.upload.speed=230400
phoenix_v2.menu.UploadSpeed.230400.macosx=230400
phoenix_v2.menu.UploadSpeed.230400.macosx.upload.speed=230400
phoenix_v2.menu.UploadSpeed.460800.linux=460800
phoenix_v2.menu.UploadSpeed.460800.linux.upload.speed=460800
phoenix_v2.menu.UploadSpeed.460800.macosx=460800
phoenix_v2.menu.UploadSpeed.460800.macosx.upload.speed=460800
phoenix_v2.menu.UploadSpeed.512000.windows=512000
phoenix_v2.menu.UploadSpeed.512000.windows.upload.speed=512000
phoenix_v2.menu.UploadSpeed.921600=921600
phoenix_v2.menu.UploadSpeed.921600.upload.speed=921600

