esp8266/Arduino/boards.txt
##############################################################
modwifi.name=Olimex MOD-WIFI-ESP8266(-DEV)
modwifi.build.board=MOD_WIFI_ESP8266
modwifi.upload.tool=esptool
modwifi.upload.speed=115200
modwifi.upload.maximum_data_size=81920
modwifi.upload.wait_for_upload_port=true
modwifi.serial.disableDTR=true
modwifi.serial.disableRTS=true
modwifi.build.mcu=esp8266
modwifi.build.core=esp8266
modwifi.build.variant=generic
modwifi.build.spiffs_pagesize=256
modwifi.build.debug_port=
modwifi.build.debug_level=
modwifi.menu.CpuFrequency.80=80 MHz
modwifi.menu.CpuFrequency.80.build.f_cpu=80000000L
modwifi.menu.CpuFrequency.160=160 MHz
modwifi.menu.CpuFrequency.160.build.f_cpu=160000000L
modwifi.upload.resetmethod=ck
modwifi.build.flash_mode=qio
modwifi.build.flash_freq=40
modwifi.menu.FlashSize.2M=2M (1M SPIFFS)
modwifi.menu.FlashSize.2M.build.flash_size=2M
modwifi.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
modwifi.menu.FlashSize.2M.build.spiffs_pagesize=256
modwifi.menu.FlashSize.2M.upload.maximum_size=1044464
modwifi.menu.FlashSize.2M.build.spiffs_start=0x100000
modwifi.menu.FlashSize.2M.build.spiffs_end=0x1FB000
modwifi.menu.FlashSize.2M.build.spiffs_blocksize=8192
modwifi.menu.LwIPVariant.open=v2
modwifi.menu.LwIPVariant.open.build.lwip_include=lwip2/include
modwifi.menu.LwIPVariant.open.build.lwip_lib=-llwip2
modwifi.menu.LwIPVariant.Prebuilt=Prebuilt Source (gcc)
modwifi.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
modwifi.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
modwifi.menu.LwIPVariant.Espressif=Espressif (xcc)
modwifi.menu.LwIPVariant.Espressif.build.lwip_lib=-llwip
modwifi.menu.LwIPVariant.Espressif.build.lwip_flags=-DLWIP_MAYBE_XCC
modwifi.menu.LwIPVariant.OpenSource=Open Source (gcc)
modwifi.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
modwifi.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
modwifi.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
modwifi.menu.Debug.Disabled=Disabled
modwifi.menu.Debug.Disabled.build.debug_port=
modwifi.menu.Debug.Serial=Serial
modwifi.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
modwifi.menu.Debug.Serial1=Serial1
modwifi.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
modwifi.menu.DebugLevel.None____=None
modwifi.menu.DebugLevel.None____.build.debug_level=
modwifi.menu.DebugLevel.SSL=SSL
modwifi.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
modwifi.menu.DebugLevel.TLS_MEM=TLS_MEM
modwifi.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
modwifi.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
modwifi.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
modwifi.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
modwifi.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
modwifi.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
modwifi.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
modwifi.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
modwifi.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
modwifi.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
modwifi.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.DebugLevel.CORE=CORE
modwifi.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
modwifi.menu.DebugLevel.WIFI=WIFI
modwifi.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
modwifi.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
modwifi.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
modwifi.menu.DebugLevel.UPDATER=UPDATER
modwifi.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
modwifi.menu.DebugLevel.OTA=OTA
modwifi.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
modwifi.menu.DebugLevel.NULL=NULL
modwifi.menu.DebugLevel.NULL.build.debug_level= -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
modwifi.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTANULL=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+NULL
modwifi.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTANULL.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTANULL=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+NULL
modwifi.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTANULL.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
modwifi.menu.UploadSpeed.115200=115200
modwifi.menu.UploadSpeed.115200.upload.speed=115200
modwifi.menu.UploadSpeed.9600=9600
modwifi.menu.UploadSpeed.9600.upload.speed=9600
modwifi.menu.UploadSpeed.57600=57600
modwifi.menu.UploadSpeed.57600.upload.speed=57600
modwifi.menu.UploadSpeed.256000.windows=256000
modwifi.menu.UploadSpeed.256000.windows.upload.speed=256000
modwifi.menu.UploadSpeed.230400.linux=230400
modwifi.menu.UploadSpeed.230400.linux.upload.speed=230400
modwifi.menu.UploadSpeed.230400.macosx=230400
modwifi.menu.UploadSpeed.230400.macosx.upload.speed=230400
modwifi.menu.UploadSpeed.460800.linux=460800
modwifi.menu.UploadSpeed.460800.linux.upload.speed=460800
modwifi.menu.UploadSpeed.460800.macosx=460800
modwifi.menu.UploadSpeed.460800.macosx.upload.speed=460800
modwifi.menu.UploadSpeed.512000.windows=512000
modwifi.menu.UploadSpeed.512000.windows.upload.speed=512000
modwifi.menu.UploadSpeed.921600=921600
modwifi.menu.UploadSpeed.921600.upload.speed=921600

