esp8266/Arduino/boards.txt
##############################################################
espinotee.name=ThaiEasyElec's ESPino
espinotee.build.board=ESP8266_ESP13
espinotee.build.variant=espinotee
espinotee.upload.tool=esptool
espinotee.upload.speed=115200
espinotee.upload.maximum_data_size=81920
espinotee.upload.wait_for_upload_port=true
espinotee.serial.disableDTR=true
espinotee.serial.disableRTS=true
espinotee.build.mcu=esp8266
espinotee.build.core=esp8266
espinotee.build.spiffs_pagesize=256
espinotee.build.debug_port=
espinotee.build.debug_level=
espinotee.menu.CpuFrequency.80=80 MHz
espinotee.menu.CpuFrequency.80.build.f_cpu=80000000L
espinotee.menu.CpuFrequency.160=160 MHz
espinotee.menu.CpuFrequency.160.build.f_cpu=160000000L
espinotee.upload.resetmethod=nodemcu
espinotee.build.flash_mode=qio
espinotee.build.flash_freq=40
espinotee.menu.FlashSize.4M1M=4M (1M SPIFFS)
espinotee.menu.FlashSize.4M1M.build.flash_size=4M
espinotee.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espinotee.menu.FlashSize.4M1M.build.spiffs_pagesize=256
espinotee.menu.FlashSize.4M1M.upload.maximum_size=1044464
espinotee.menu.FlashSize.4M1M.build.spiffs_start=0x300000
espinotee.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
espinotee.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
espinotee.menu.FlashSize.4M3M=4M (3M SPIFFS)
espinotee.menu.FlashSize.4M3M.build.flash_size=4M
espinotee.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
espinotee.menu.FlashSize.4M3M.build.spiffs_pagesize=256
espinotee.menu.FlashSize.4M3M.upload.maximum_size=1044464
espinotee.menu.FlashSize.4M3M.build.spiffs_start=0x100000
espinotee.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
espinotee.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
espinotee.menu.LwIPVariant.open=v2
espinotee.menu.LwIPVariant.open.build.lwip_include=lwip2/include
espinotee.menu.LwIPVariant.open.build.lwip_lib=-llwip2
espinotee.menu.LwIPVariant.Prebuilt=Prebuilt Source (gcc)
espinotee.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
espinotee.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
espinotee.menu.LwIPVariant.Espressif=Espressif (xcc)
espinotee.menu.LwIPVariant.Espressif.build.lwip_lib=-llwip
espinotee.menu.LwIPVariant.Espressif.build.lwip_flags=-DLWIP_MAYBE_XCC
espinotee.menu.LwIPVariant.OpenSource=Open Source (gcc)
espinotee.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
espinotee.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
espinotee.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espinotee.menu.Debug.Disabled=Disabled
espinotee.menu.Debug.Disabled.build.debug_port=
espinotee.menu.Debug.Serial=Serial
espinotee.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espinotee.menu.Debug.Serial1=Serial1
espinotee.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espinotee.menu.DebugLevel.None____=None
espinotee.menu.DebugLevel.None____.build.debug_level=
espinotee.menu.DebugLevel.SSL=SSL
espinotee.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
espinotee.menu.DebugLevel.TLS_MEM=TLS_MEM
espinotee.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espinotee.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
espinotee.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
espinotee.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
espinotee.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espinotee.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espinotee.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
espinotee.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espinotee.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espinotee.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espinotee.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.DebugLevel.CORE=CORE
espinotee.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
espinotee.menu.DebugLevel.WIFI=WIFI
espinotee.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espinotee.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
espinotee.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espinotee.menu.DebugLevel.UPDATER=UPDATER
espinotee.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espinotee.menu.DebugLevel.OTA=OTA
espinotee.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
espinotee.menu.DebugLevel.NULL=NULL
espinotee.menu.DebugLevel.NULL.build.debug_level= -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
espinotee.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTANULL=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+NULL
espinotee.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTANULL.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTANULL=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+NULL
espinotee.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTANULL.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_NULL -include "umm_malloc/umm_malloc_cfg.h"
espinotee.menu.UploadSpeed.115200=115200
espinotee.menu.UploadSpeed.115200.upload.speed=115200
espinotee.menu.UploadSpeed.9600=9600
espinotee.menu.UploadSpeed.9600.upload.speed=9600
espinotee.menu.UploadSpeed.57600=57600
espinotee.menu.UploadSpeed.57600.upload.speed=57600
espinotee.menu.UploadSpeed.256000.windows=256000
espinotee.menu.UploadSpeed.256000.windows.upload.speed=256000
espinotee.menu.UploadSpeed.230400.linux=230400
espinotee.menu.UploadSpeed.230400.linux.upload.speed=230400
espinotee.menu.UploadSpeed.230400.macosx=230400
espinotee.menu.UploadSpeed.230400.macosx.upload.speed=230400
espinotee.menu.UploadSpeed.460800.linux=460800
espinotee.menu.UploadSpeed.460800.linux.upload.speed=460800
espinotee.menu.UploadSpeed.460800.macosx=460800
espinotee.menu.UploadSpeed.460800.macosx.upload.speed=460800
espinotee.menu.UploadSpeed.512000.windows=512000
espinotee.menu.UploadSpeed.512000.windows.upload.speed=512000
espinotee.menu.UploadSpeed.921600=921600
espinotee.menu.UploadSpeed.921600.upload.speed=921600

